## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 11 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_subscription_filter.idp_error_detection[0]`    |
|        | `aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count[&quot;HTTP1&quot;]`   |
|        | `aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count[&quot;HTTP2&quot;]`   |
|        | `aws_cloudwatch_metric_alarm.idb_lb_unhealthy_host_count[&quot;HTTP1&quot;]` |
|        | `aws_cloudwatch_metric_alarm.idb_lb_unhealthy_host_count[&quot;HTTP2&quot;]` |
|        | `aws_cloudwatch_metric_alarm.idp_bounce_rate_high[0]`              |
|        | `aws_cloudwatch_metric_alarm.idp_complaint_rate_high[0]`           |
|        | `aws_cloudwatch_metric_alarm.idp_cpu_utilization_high_warn[0]`     |
|        | `aws_cloudwatch_metric_alarm.idp_memory_utilization_high_warn[0]`  |
|        | `aws_cloudwatch_metric_alarm.idp_rds_cpu_utilization[0]`           |
|        | `aws_cloudwatch_metric_alarm.idp_response_time_warn[0]`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_subscription_filter.idp_error_detection[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "idp_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:notify-slack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "level=error"
      + id              = (known after apply)
      + log_group_name  = "/aws/ecs/idp/zitadel"
      + name            = "error_detection_in_idp_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count["HTTP1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "idb_lb_healthy_host_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP LB Critical - no healthy HTTP1 hosts in a 1 minute period"
      + alarm_name                            = "IdP-HealthyHostCount-HTTP1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "loadbalancer/app/idp/1234567890123456"
          + "TargetGroup"  = "targetgroup/idp-tg-http1-abc/1234567890123456"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idb_lb_healthy_host_count["HTTP2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "idb_lb_healthy_host_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP LB Critical - no healthy HTTP2 hosts in a 1 minute period"
      + alarm_name                            = "IdP-HealthyHostCount-HTTP2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "loadbalancer/app/idp/1234567890123456"
          + "TargetGroup"  = "targetgroup/idp-tg-http2-abc/1234567890123456"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idb_lb_unhealthy_host_count["HTTP1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "idb_lb_unhealthy_host_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP LB Warning - unhealthy HTTP1 host count >= 1 in a 1 minute period"
      + alarm_name                            = "IdP-UnhealthyHostCount-HTTP1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "loadbalancer/app/idp/1234567890123456"
          + "TargetGroup"  = "targetgroup/idp-tg-http1-abc/1234567890123456"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idb_lb_unhealthy_host_count["HTTP2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "idb_lb_unhealthy_host_count" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP LB Warning - unhealthy HTTP2 host count >= 1 in a 1 minute period"
      + alarm_name                            = "IdP-UnhealthyHostCount-HTTP2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "loadbalancer/app/idp/1234567890123456"
          + "TargetGroup"  = "targetgroup/idp-tg-http2-abc/1234567890123456"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idp_bounce_rate_high[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "idp_bounce_rate_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP SES Warning - bounce rate >=7% over the last 12 hours"
      + alarm_name                            = "IdP-SESBounceRate"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Reputation.BounceRate"
      + namespace                             = "AWS/SES"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 43200
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 0.07
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idp_complaint_rate_high[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "idp_complaint_rate_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP SES Warning - complaint rate >=0.4% over the last 12 hours"
      + alarm_name                            = "IdP-SESComplaintRate"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Reputation.ComplaintRate"
      + namespace                             = "AWS/SES"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 43200
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 0.004
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idp_cpu_utilization_high_warn[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "idp_cpu_utilization_high_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP ECS Warning - High CPU usage has been detected."
      + alarm_name                            = "IdP-CpuUtilizationWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "idp"
          + "ServiceName" = "zitadel"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idp_memory_utilization_high_warn[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "idp_memory_utilization_high_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP ECS Warning - High memory usage has been detected."
      + alarm_name                            = "IdP-MemoryUtilizationWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "idp"
          + "ServiceName" = "zitadel"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.idp_rds_cpu_utilization[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "idp_rds_cpu_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP RDS Warning - high CPU use for RDS cluster in a 5 minute period"
      + alarm_name                            = "IdP-RDSCpuUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBClusterIdentifier" = "idp-cluster"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.idp_response_time_warn[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "idp_response_time_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "IdP LB Warning - The latency of response times from the IdP are abnormally high."
      + alarm_name                            = "IdP-ResponseTimeWarn"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "response_time"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "LoadBalancer" = "loadbalancer/app/idp/1234567890123456"
                }
              + metric_name = "TargetResponseTime"
              + namespace   = "AWS/ApplicationELB"
              + period      = 60
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.rds_data_catalog"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_healthy_hosts"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
